Mobile/DataProcessors/ЗаписьНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаписьНаУслуги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Mobile/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Mobile/DataProcessors/ЗаписьНаУслуги/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
    Если ЗначениеЗаполнено(Объект.Услуга) Тогда
        Объект.Стоимость = ПолучитьСтоимостьУслуги(Объект.Услуга);
    КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьУслуги(Услуга)
    Возврат Услуга.Стоимость;
КонецФункции

&НаКлиенте
Процедура ЗаписатьсяНажатие(Элемент)
	Если Объект.ДатаЗаписи < ТекущаяДата() Тогда
        Объект.ДатаЗаписи = ТекущаяДата();
        Сообщить("Запись на прошедшую дату невозможна. Дата установлена на текущую.");
    КонецЕсли;
    СтрокаJSON = СформироватьJSON(Объект.ДатаЗаписи, Объект.Сотрудник, Объект.Услуга, Объект.Стоимость, Объект.Логин);
    ДокументОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтрокаJSON);
    Если ДокументОтправлен Тогда
        СоздатьДокументВМобилке(Объект.Сотрудник, Объект.Услуга, Объект.Стоимость);
        Сообщить(СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3",
            Объект.Услуга, Объект.Сотрудник,
            Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'")));
        ОткрытьФорму("Документ.ЗаписьКлиента.ФормаСписка");
    Иначе
        Сообщить("Не удалось отправить запись в основную базу!");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Логин) Тогда
		Объект.Логин = Параметры.Логин;
	Иначе
		Объект.Логин = АутентификацияИАвторизация.ЛогинТекущегоПользователя();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументВМобилке(Сотрудник, Услуга, Стоимость)
	НоваяЗапись           = Документы.ЗаписьКлиента.СоздатьДокумент();
	НоваяЗапись.Дата      = ТекущаяДата();
	НоваяЗапись.Сотрудник = Сотрудник;
	НовСтрока             = НоваяЗапись.Услуги.Добавить();
	НовСтрока.Услуга      = Услуга;
	НовСтрока.Стоимость   = Стоимость;
	НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьJSON(ДатаЗаписи, Сотрудник, Услуга, Стоимость, Логин)
    МассивУслуг = Новый Массив;
    СтрУслуги = Новый Структура;
    СтрУслуги.Вставить("Услуга",    Строка(Услуга));
    СтрУслуги.Вставить("Стоимость", Стоимость);
    МассивУслуг.Добавить(СтрУслуги);

    ДанныеJSON = Новый Структура;
    ДанныеJSON.Вставить("ДатаЗаписи", ЗаписатьДатуJSON(ДатаЗаписи, ФорматДатыJSON.ISO));    
	ДанныеJSON.Вставить("Сотрудник",  Строка(Сотрудник));
    ДанныеJSON.Вставить("Логин",      Логин);
    ДанныеJSON.Вставить("МассивУслуг", МассивУслуг);

    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
    Возврат ЗаписьJSON.Закрыть();
КонецФункции
